MaurinElectroTextile/Active_matrix/Proto_2_v_3_1.cywrk/Proto_2_v_2_1\Proto 2.cydsn\Generated_Source\PSoC5\UART_1.h
#if(UART_1_HD_ENABLED)

    #define UART_1_TXDATA_REG             (* (reg8 *) UART_1_BUART_sRX_RxShifter_u0__F1_REG )
    #define UART_1_TXDATA_PTR             (  (reg8 *) UART_1_BUART_sRX_RxShifter_u0__F1_REG )

    #define UART_1_TXSTATUS_REG           (* (reg8 *) UART_1_BUART_sRX_RxSts__STATUS_REG )
    #define UART_1_TXSTATUS_PTR           (  (reg8 *) UART_1_BUART_sRX_RxSts__STATUS_REG )
    #define UART_1_TXSTATUS_MASK_REG      (* (reg8 *) UART_1_BUART_sRX_RxSts__MASK_REG )
    #define UART_1_TXSTATUS_MASK_PTR      (  (reg8 *) UART_1_BUART_sRX_RxSts__MASK_REG )
    #define UART_1_TXSTATUS_ACTL_REG      (* (reg8 *) UART_1_BUART_sRX_RxSts__STATUS_AUX_CTL_REG )
    #define UART_1_TXSTATUS_ACTL_PTR      (  (reg8 *) UART_1_BUART_sRX_RxSts__STATUS_AUX_CTL_REG )
#endif /* End UART_1_HD_ENABLED */

#if( (UART_1_RX_ENABLED) || (UART_1_HD_ENABLED) )
    #define UART_1_RXDATA_REG             (* (reg8 *) UART_1_BUART_sRX_RxShifter_u0__F0_REG )
    #define UART_1_RXDATA_PTR             (  (reg8 *) UART_1_BUART_sRX_RxShifter_u0__F0_REG )
    #define UART_1_RXADDRESS1_REG         (* (reg8 *) UART_1_BUART_sRX_RxShifter_u0__D0_REG )
    #define UART_1_RXADDRESS1_PTR         (  (reg8 *) UART_1_BUART_sRX_RxShifter_u0__D0_REG )
    #define UART_1_RXADDRESS2_REG         (* (reg8 *) UART_1_BUART_sRX_RxShifter_u0__D1_REG )
    #define UART_1_RXADDRESS2_PTR         (  (reg8 *) UART_1_BUART_sRX_RxShifter_u0__D1_REG )

    #define UART_1_RXBITCTR_PERIOD_REG    (* (reg8 *) UART_1_BUART_sRX_RxBitCounter__PERIOD_REG )
    #define UART_1_RXBITCTR_PERIOD_PTR    (  (reg8 *) UART_1_BUART_sRX_RxBitCounter__PERIOD_REG )
    #define UART_1_RXBITCTR_CONTROL_REG   \
                                        (* (reg8 *) UART_1_BUART_sRX_RxBitCounter__CONTROL_AUX_CTL_REG )
    #define UART_1_RXBITCTR_CONTROL_PTR   \
                                        (  (reg8 *) UART_1_BUART_sRX_RxBitCounter__CONTROL_AUX_CTL_REG )
    #define UART_1_RXBITCTR_COUNTER_REG   (* (reg8 *) UART_1_BUART_sRX_RxBitCounter__COUNT_REG )
    #define UART_1_RXBITCTR_COUNTER_PTR   (  (reg8 *) UART_1_BUART_sRX_RxBitCounter__COUNT_REG )

    #define UART_1_RXSTATUS_REG           (* (reg8 *) UART_1_BUART_sRX_RxSts__STATUS_REG )
    #define UART_1_RXSTATUS_PTR           (  (reg8 *) UART_1_BUART_sRX_RxSts__STATUS_REG )
    #define UART_1_RXSTATUS_MASK_REG      (* (reg8 *) UART_1_BUART_sRX_RxSts__MASK_REG )
    #define UART_1_RXSTATUS_MASK_PTR      (  (reg8 *) UART_1_BUART_sRX_RxSts__MASK_REG )
    #define UART_1_RXSTATUS_ACTL_REG      (* (reg8 *) UART_1_BUART_sRX_RxSts__STATUS_AUX_CTL_REG )
    #define UART_1_RXSTATUS_ACTL_PTR      (  (reg8 *) UART_1_BUART_sRX_RxSts__STATUS_AUX_CTL_REG )
#endif /* End  (UART_1_RX_ENABLED) || (UART_1_HD_ENABLED) */

#if(UART_1_INTERNAL_CLOCK_USED)
    /* Register to enable or disable the digital clocks */
    #define UART_1_INTCLOCK_CLKEN_REG     (* (reg8 *) UART_1_IntClock__PM_ACT_CFG)
    #define UART_1_INTCLOCK_CLKEN_PTR     (  (reg8 *) UART_1_IntClock__PM_ACT_CFG)

    /* Clock mask for this clock. */
    #define UART_1_INTCLOCK_CLKEN_MASK    UART_1_IntClock__PM_ACT_MSK
#endif /* End UART_1_INTERNAL_CLOCK_USED */


/***************************************
* Renamed global variables or defines 
* for backward compatible
***************************************/

#define UART_1_initvar                    UART_1_initVar

#define UART_1_RX_Enabled                 UART_1_RX_ENABLED
#define UART_1_TX_Enabled                 UART_1_TX_ENABLED
#define UART_1_HD_Enabled                 UART_1_HD_ENABLED
#define UART_1_RX_IntInterruptEnabled     UART_1_RX_INTERRUPT_ENABLED
#define UART_1_TX_IntInterruptEnabled     UART_1_TX_INTERRUPT_ENABLED
#define UART_1_InternalClockUsed          UART_1_INTERNAL_CLOCK_USED
#define UART_1_RXHW_Address_Enabled       UART_1_RXHW_ADDRESS_ENABLED
#define UART_1_OverSampleCount            UART_1_OVER_SAMPLE_COUNT
#define UART_1_ParityType                 UART_1_PARITY_TYPE

#if( UART_1_TX_ENABLED && (UART_1_TXBUFFERSIZE > UART_1_FIFO_LENGTH))
    #define UART_1_TXBUFFER               UART_1_txBuffer
    #define UART_1_TXBUFFERREAD           UART_1_txBufferRead 
    #define UART_1_TXBUFFERWRITE          UART_1_txBufferWrite 
#endif /* End UART_1_TX_ENABLED */
#if( ( UART_1_RX_ENABLED || UART_1_HD_ENABLED ) && \
     (UART_1_RXBUFFERSIZE > UART_1_FIFO_LENGTH) )
    #define UART_1_RXBUFFER               UART_1_rxBuffer
    #define UART_1_RXBUFFERREAD           UART_1_rxBufferRead 
    #define UART_1_RXBUFFERWRITE          UART_1_rxBufferWrite 
    #define UART_1_RXBUFFERLOOPDETECT     UART_1_rxBufferLoopDetect
    #define UART_1_RXBUFFER_OVERFLOW      UART_1_rxBufferOverflow
#endif /* End UART_1_RX_ENABLED */

#ifdef UART_1_BUART_sCR_AsyncCtl_CtrlReg__CONTROL_REG
    #define UART_1_CONTROL                UART_1_CONTROL_REG 
#endif /* End UART_1_BUART_sCR_AsyncCtl_CtrlReg__CONTROL_REG */

#if(UART_1_TX_ENABLED)
    #define UART_1_TXDATA                 UART_1_TXDATA_REG
    #define UART_1_TXSTATUS               UART_1_TXSTATUS_REG
    #define UART_1_TXSTATUS_MASK          UART_1_TXSTATUS_MASK_REG   
    #define UART_1_TXSTATUS_ACTL          UART_1_TXSTATUS_ACTL_REG
    /* DP clock */
    #if(UART_1_TXCLKGEN_DP)
        #define UART_1_TXBITCLKGEN_CTR        UART_1_TXBITCLKGEN_CTR_REG
        #define UART_1_TXBITCLKTX_COMPLETE    UART_1_TXBITCLKTX_COMPLETE_REG
    #else     /* Count7 clock*/
        #define UART_1_TXBITCTR_PERIOD        UART_1_TXBITCTR_PERIOD_REG
        #define UART_1_TXBITCTR_CONTROL       UART_1_TXBITCTR_CONTROL_REG
        #define UART_1_TXBITCTR_COUNTER       UART_1_TXBITCTR_COUNTER_REG
    #endif /* UART_1_TXCLKGEN_DP */
#endif /* End UART_1_TX_ENABLED */

#if(UART_1_HD_ENABLED)
    #define UART_1_TXDATA                 UART_1_TXDATA_REG
    #define UART_1_TXSTATUS               UART_1_TXSTATUS_REG
    #define UART_1_TXSTATUS_MASK          UART_1_TXSTATUS_MASK_REG   
    #define UART_1_TXSTATUS_ACTL          UART_1_TXSTATUS_ACTL_REG
#endif /* End UART_1_HD_ENABLED */

#if( (UART_1_RX_ENABLED) || (UART_1_HD_ENABLED) )
    #define UART_1_RXDATA                 UART_1_RXDATA_REG             
    #define UART_1_RXADDRESS1             UART_1_RXADDRESS1_REG
    #define UART_1_RXADDRESS2             UART_1_RXADDRESS2_REG
    #define UART_1_RXBITCTR_PERIOD        UART_1_RXBITCTR_PERIOD_REG
    #define UART_1_RXBITCTR_CONTROL       UART_1_RXBITCTR_CONTROL_REG
    #define UART_1_RXBITCTR_COUNTER       UART_1_RXBITCTR_COUNTER_REG
    #define UART_1_RXSTATUS               UART_1_RXSTATUS_REG
    #define UART_1_RXSTATUS_MASK          UART_1_RXSTATUS_MASK_REG
    #define UART_1_RXSTATUS_ACTL          UART_1_RXSTATUS_ACTL_REG
#endif /* End  (UART_1_RX_ENABLED) || (UART_1_HD_ENABLED) */

#if(UART_1_INTERNAL_CLOCK_USED)
    #define UART_1_INTCLOCK_CLKEN         UART_1_INTCLOCK_CLKEN_REG
#endif /* End UART_1_INTERNAL_CLOCK_USED */

#endif  /* CY_UART_UART_1_H */


/* [] END OF FILE */
